{"id":1944,"date":"2022-09-28T19:48:32","date_gmt":"2022-09-28T19:48:32","guid":{"rendered":"https:\/\/www.techprocomp.com\/?post_type=cyber-security&#038;p=1944"},"modified":"2023-04-10T15:38:24","modified_gmt":"2023-04-10T15:38:24","slug":"endpoints-detection-and-response","status":"publish","type":"cyber-security","link":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/","title":{"rendered":"Endpoints detection and response"},"content":{"rendered":"\r\n<!-- Service Content Block -->\r\n<div id=\"particles-js\" class=\"block service-content-block  py-5\">\r\n\r\n    <section class=\"\">\r\n        <!--  Particle effect -->\r\n        <div id=\"\">\r\n            <div class=\"container\">\r\n                <div class=\"row\">\r\n                    <!-- Title -->\r\n                                            <div class=\"col-md-12 text-center mb-5\">\r\n                            <h2 class=\"service-content-block-title-black title-black\">Endpoints                                                                 <span class=\"service-content-block-title-blue title-blue\">detection and response<\/span>\r\n                            <\/h2>\r\n                            <div class=\"divider mx-auto my-4\"><\/div>                                                    <\/div>\r\n                                        <!-- Left Content -->\r\n                    <div class=\"col-md-4 col-12 service-content-block-left\">\r\n                        <p class=\"service-content-block-left-description\"><strong>Make sure you detect and remove all potential threats to your company before they even get the chance to harm you in any way!<\/strong><\/p>                    <\/div>\r\n                    <!-- Right content -->\r\n                    <div class=\"col-md-8 col-12 service-content-block-right z-index-1\">\r\n                        <div class=\"service-content-block-right-description\" style=\"font-size:px; font-weight:\"><h3>What is endpoints detection and response (EDR)?<\/h3>\n<p>EDR (Endpoint Detection and Response), also known as endpoint detection and threat response (EDTR), is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware. EDR is defined as a security solution that records and stores endpoint-system-level behaviors, provides contextual information, uses data analytics techniques to detect suspicious behavior, block malicious activity, and offers suggestions to restore corrupt systems.<\/p>\n<h3>How does EDR work?<\/h3>\n<p>Endpoint detection and response security solutions record all the activities and events taking place on all workloads and endpoints, providing dedicated security teams with visibility, then need to find incidents that would remain invisible and harm the system. EDR solution has to provide constant and comprehensive visibility into what is happening on endpoints in real-time; otherwise, it wouldn’t be as effective. Any EDR should offer advanced threat detection, investigation, and response capabilities, including incident data search, suspicious activity validation, investigation alert triage, threat hunting, malicious activity detection, and final containment.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2129\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/EDR-content-image.jpg\" alt=\"\" width=\"755\" height=\"425\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/EDR-content-image.jpg 755w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/EDR-content-image-300x169.jpg 300w\" sizes=\"(max-width: 755px) 100vw, 755px\" \/><\/p>\n<\/div>\r\n                        <!-- Read more section -->\r\n                                                    <span id=\"read-more\" class=\"d-block cursor-pointer read-more-style mb-4 text-white\">Read more&#8230;<\/span>\r\n                            <div id=\"read-more-content\" class=\"service-content-block-right-description\"><h3>Most important EDR functions<\/h3>\n<h4>Uncovering stealthy attackers automatically<\/h4>\n<p>EDR technology pairs IOAs with comprehensive visibility across all endpoints. It applies behavioral analytics that analyzes a ton of events in real-time in order to detect traces of suspicious behavior automatically. The EDR tool needs to understand individual events as a part of a<br \/>\nbroader sequence to apply security logic from the provider’s intelligence. If the events match a known IOA, the EDR tool automatically marks the activity as malicious and sends a detection alert. Users are also allowed to write their own custom searches that can go back up to 90 days.<\/p>\n<h4>EDR integrates with threat intelligence<\/h4>\n<p>Integration with threat intelligence provides a lot faster detection of tactics, activities, procedures, and techniques identified as malicious. This delivers information that includes attribution where relevant, providing all details on the adversary and any other information known about the cyber-attack.<\/p>\n<h4>Managed thread hunting for proactive defense<\/h4>\n<p>The threat hunters work proactively to hunt, advise and investigate threat activity in your environment by using EDR. When the tool finds a threat, it works alongside the team to triage, investigate and remediate the incident before the issue becomes a lot worse.<\/p>\n<h4>EDR provides real-time and historical visibility<\/h4>\n<p>EDR can be described as a DVR on the endpoint. It records every relevant activity in order to catch incidents that evaded prevention. From a security perspective, all customers are given comprehensive visibility into everything that is going on at their endpoints. Your provider tracks a lot of different security-related events, like process creation, registry mods, driver loading, memory and disk access, or network connections.<\/p>\n<p>All these things give a security team the helpful information they need, including:<\/p>\n<ul>\n<li>External and local addresses to which the host is connected<\/li>\n<li>All user accounts that have logged in, whether remotely or directly<\/li>\n<li>A summary of changes to ASP keys<\/li>\n<li>Process executions<\/li>\n<li>Summary and detailed process-level network activity, including connections, DNS requests, and open ports<\/li>\n<li>Archive files, including both RARs and ZIPs<\/li>\n<li>Removable media usage<\/li>\n<\/ul>\n<p>This complete list of endpoint activities allows a security team to go through activities in real-time, observing which commands they are running and what techniques they are using, even if they try breaching or moving around an environment.<\/p>\n<h3>Accelerates investigations<\/h3>\n<p>EDR from your provider is able to speed up the investigation because the information gathered from endpoints is stored in the cloud. The model keeps track of all relationships and contacts between all endpoints using an extensive graph database, which provides all the details and context for real-time and historical data. This allows security teams to investigate incidents right away. This speed and level of visibility, combined with intelligence, provides all the necessary information to understand the data thoroughly. This will allow security teams to track even the most sophisticated cyber-attacks and uncover incidents, validate and prioritize them, leading to more precise remediation.<\/p>\n<h3>Enables decisive and fast remediation<\/h3>\n<p>EDR is capable of isolating the endpoint called “network containment.” This allows organizations to take quick action by isolating potentially hazardous hosts from all networks. The endpoint can still receive and send information from the cloud, even when under containment. It will remain contained even if the connection is cut to the cloud and will remain in this state during reboots. EDR from your provider includes a real-time response, providing much better visibility that allows security teams to understand the threats immediately and deal with them directly while creating no impact on the performance.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2131\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response.webp\" alt=\"\" width=\"1920\" height=\"1277\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response.webp 1920w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response-300x200.webp 300w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response-1024x681.webp 1024w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response-768x511.webp 768w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/edr-response-1536x1022.webp 1536w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h3>What should interest you in an EDR solution?<\/h3>\n<p>Understanding what EDR security does and why it is essential should be the only thing on your mind. You need to find an EDR solution that can provide the best level of protection while requiring as little effort and investment as possible.<br \/>\nThese are the six important things you should look for in an EDR:<\/p>\n<ol>\n<li><strong>Endpoint visibility:<\/strong> Real-time visibility across your endpoints allows you to see all activities, even when they breach your environment, and stop them immediately.<\/li>\n<li><strong>Threat database:<\/strong> A good EDR needs a massive amount of telemetry gathered from endpoints and enriched with context so it can be searched for signs of cyber-attacks with different analytic techniques.<\/li>\n<li><strong>Behavioral protection:<\/strong> Relying only on signature-based methods or IOCs (indicators of compromise) eventually leads to failure that allows data breaches to happen. Good EDR requires behavioral approaches that look for IOAs (Indicators of attack), so you are notified of suspicious activities before the breach occurs.<\/li>\n<li><strong>Intelligence and insight:<\/strong> An EDR solution that integrates threat intelligence can provide details of an attributed adversary attacking you or about to attack your information. 5. Quick response: EDR that allows fast and accurate response can stop an attack before it even happens and allows your company to return to business quickly.<\/li>\n<li><strong>Quick response:<\/strong> EDR that allows fast and accurate response can stop an attack before it even happens and allows your company to return to business quickly<\/li>\n<li><strong>Cloud-based solution:<\/strong> The only way to ensure zero impact on endpoints is to have a cloud-based EDR. Also, this type of solution makes sure capabilities such as analysis, search and investigation can be done accurately in real-time.<\/li>\n<\/ol>\n<h3>Reasons why EDR is important<\/h3>\n<p>Every business owner should know that with enough motivation, time and resources, intruders will find a way to breach your system, no matter how advanced it is. We are giving you a list of reasons why EDR should be a part of your endpoint security.<\/p>\n<ol>\n<li><strong>Prevention can’t ensure 100% protection:<\/strong> Prevention will eventually fail, and your organization will be left in the dark by its current security solutions. Attackers can take advantage of that situation and get access to your network.<\/li>\n<li><strong>Adversaries can come and go inside your network at their will:<\/strong><br \/>\nAttackers are free to move around in your network because of a silent failure. This often creates a back door that allows them to come back at their will. In most cases, organizations learn about the breach after being informed by law enforcement or by their customers or suppliers.<\/li>\n<li><strong>Organizations need more visibility to monitor endpoints effectively:<\/strong><br \/>\nOnce the breach is discovered, the security team can spend weeks, if not months trying to find the incident because it lacks the visibility required to see precisely what is happening and how to fix the problem.<\/li>\n<li><strong>Access to intelligence is required to respond to a breach:<\/strong> Some organizations might not be able to record what is relevant to security, store it and finally recall the information when needed.<\/li>\n<li><strong>Having the data is only one part of the solution:<\/strong> Even if the information is available, security teams still need the required resources to analyze it. Security teams can face complex data problems once the breach happens. They will run into several challenges until they get to their primary objective.<\/li>\n<li><strong>Remediation can be protracted and expensive:<\/strong> Organizations can spend weeks trying to fix the problem without all the capabilities listed above. This disrupts the business process, eventually leading to serious financial loss.<\/li>\n<\/ol>\n<h3>Should you opt for the EDR solution?<\/h3>\n<p>We are not here to tell you that you should opt for endpoint detection and response but to tell you all the advantages. We have listed all the good things about this solution, and it is all up to you to decide whether you want to use this security solution or not. If you have any additional questions, feel free to contact our customer support team at TechProComp. We will gladly answer all your questions and help you make the right decision for your organization.<\/p>\n<\/div>                        \r\n\r\n                        <!-- Schedule button -->\r\n                                                    <a href=\"https:\/\/www.techprocomp.com\/schedule-free-consultation\/\" class=\"hero-block_schedule-btn\">Schedule a free consultation<img decoding=\"async\" src=\"\/wp-content\/uploads\/2023\/10\/arrow-right-tpc-icon.svg\" class=\"img-fluid ms-3 arrow-img\" alt=\"Schedule a free consultation\" width=\"8px\" height=\"8px\" title=\"Schedule a free consultation\" loading=\"lazy\"><\/a>\r\n                                                <!-- Services button -->\r\n                        \r\n                        <!-- Read more section -->\r\n                        \r\n                    <\/div>\r\n                <\/div>\r\n            <\/div>\r\n        <\/div>\r\n    <\/section>\r\n\r\n<\/div><!-- End Service Content Block -->\r\n\r\n<script src=\"https:\/\/cdn.jsdelivr.net\/npm\/particles.js@2.0.0\/particles.min.js\"><\/script>\r\n<script>\r\n    \/* ---- particles.js config ---- *\/\r\n    width = jQuery(document).width();\r\n    if (width > 768) {\r\n        particlesJS(\"particles-js\", {\r\n            \"particles\": {\r\n                \"number\": {\r\n                    \"value\": 40,\r\n                    \"density\": {\r\n                        \"enable\": true,\r\n                        \"value_area\": 600\r\n                    }\r\n                },\r\n                \"color\": {\r\n                    \"value\": \"#0c5adb\"\r\n                },\r\n                \"shape\": {\r\n                    \"type\": \"circle\",\r\n                    \"stroke\": {\r\n                        \"width\": 0,\r\n                        \"color\": \"#ffffff\"\r\n                    },\r\n                    \"polygon\": {\r\n                        \"nb_sides\": 5\r\n                    },\r\n                    \"image\": {\r\n                        \"src\": \"img\/github.svg\",\r\n                        \"width\": 100,\r\n                        \"height\": 100\r\n                    }\r\n                },\r\n                \"opacity\": {\r\n                    \"value\": 0.5,\r\n                    \"random\": false,\r\n                    \"anim\": {\r\n                        \"enable\": false,\r\n                        \"speed\": 0.1,\r\n                        \"opacity_min\": 0.1,\r\n                        \"sync\": false\r\n                    }\r\n                },\r\n                \"size\": {\r\n                    \"value\": 3,\r\n                    \"random\": true,\r\n                    \"anim\": {\r\n                        \"enable\": false,\r\n                        \"speed\": 20,\r\n                        \"size_min\": 0.1,\r\n                        \"sync\": false\r\n                    }\r\n                },\r\n                \"line_linked\": {\r\n                    \"enable\": true,\r\n                    \"distance\": 250,\r\n                    \"color\": \"#ffffff\",\r\n                    \"opacity\": 0.2,\r\n                    \"width\": 1\r\n                },\r\n                \"move\": {\r\n                    \"enable\": true,\r\n                    \"speed\": 2,\r\n                    \"direction\": \"none\",\r\n                    \"random\": true,\r\n                    \"straight\": false,\r\n                    \"out_mode\": \"out\",\r\n                    \"bounce\": false,\r\n                    \"attract\": {\r\n                        \"enable\": false,\r\n                        \"rotateX\": 300,\r\n                        \"rotateY\": 600\r\n                    }\r\n                }\r\n            },\r\n            \"interactivity\": {\r\n                \"detect_on\": \"canvas\",\r\n                \"events\": {\r\n                    \"onhover\": {\r\n                        \"enable\": true,\r\n                        \"mode\": \"repulse\"\r\n                    },\r\n                    \"onclick\": {\r\n                        \"enable\": true,\r\n                        \"mode\": \"push\"\r\n                    },\r\n                    \"resize\": true\r\n                },\r\n                \"modes\": {\r\n                    \"grab\": {\r\n                        \"distance\": 100,\r\n                        \"line_linked\": {\r\n                            \"opacity\": 0.2\r\n                        }\r\n                    },\r\n                    \r\n                    \"repulse\": {\r\n                        \"distance\": 100,\r\n                        \"duration\": 0.4\r\n                    },\r\n                    \"push\": {\r\n                        \"particles_nb\": 4\r\n                    },\r\n                    \"remove\": {\r\n                        \"particles_nb\": 0\r\n                    }\r\n                }\r\n            },\r\n            \"retina_detect\": true,\r\n\r\n        });\r\n    } else {\r\n\r\n    }\r\n<\/script>\r\n","protected":false},"excerpt":{"rendered":"","protected":false},"featured_media":2129,"comment_status":"open","ping_status":"closed","template":"single-cyber-security.php","meta":[],"cyber-security_category":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Endpoints detection and response - TechProComp<\/title>\n<meta name=\"description\" content=\"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Endpoints detection and response - TechProComp\" \/>\n<meta property=\"og:description\" content=\"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/\" \/>\n<meta property=\"og:site_name\" content=\"TechProComp - Managed IT Service Provider\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/TechProComp\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-04-10T15:38:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/EDR-content-image.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"755\" \/>\n\t<meta property=\"og:image:height\" content=\"425\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@techprocompcorp\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/\",\"url\":\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/\",\"name\":\"Endpoints detection and response - TechProComp\",\"isPartOf\":{\"@id\":\"https:\/\/www.techprocomp.com\/#website\"},\"datePublished\":\"2022-09-28T19:48:32+00:00\",\"dateModified\":\"2023-04-10T15:38:24+00:00\",\"description\":\"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.techprocomp.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Endpoints detection and response\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.techprocomp.com\/#website\",\"url\":\"https:\/\/www.techprocomp.com\/\",\"name\":\"TechProComp - Managed IT Service Provider\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.techprocomp.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.techprocomp.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.techprocomp.com\/#organization\",\"name\":\"TechProComp - Managed IT Service Provider\",\"url\":\"https:\/\/www.techprocomp.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg\",\"contentUrl\":\"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg\",\"width\":1,\"height\":1,\"caption\":\"TechProComp - Managed IT Service Provider\"},\"image\":{\"@id\":\"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/TechProComp\/\",\"https:\/\/twitter.com\/techprocompcorp\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Endpoints detection and response - TechProComp","description":"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/","og_locale":"en_US","og_type":"article","og_title":"Endpoints detection and response - TechProComp","og_description":"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.","og_url":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/","og_site_name":"TechProComp - Managed IT Service Provider","article_publisher":"https:\/\/www.facebook.com\/TechProComp\/","article_modified_time":"2023-04-10T15:38:24+00:00","og_image":[{"width":755,"height":425,"url":"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/09\/EDR-content-image.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@techprocompcorp","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/","url":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/","name":"Endpoints detection and response - TechProComp","isPartOf":{"@id":"https:\/\/www.techprocomp.com\/#website"},"datePublished":"2022-09-28T19:48:32+00:00","dateModified":"2023-04-10T15:38:24+00:00","description":"EDR is a security solution that constantly monitors devices to detect and respond to cyber threats like malware and ransomware.","breadcrumb":{"@id":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.techprocomp.com\/cyber-security\/endpoints-detection-and-response\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.techprocomp.com\/"},{"@type":"ListItem","position":2,"name":"Endpoints detection and response"}]},{"@type":"WebSite","@id":"https:\/\/www.techprocomp.com\/#website","url":"https:\/\/www.techprocomp.com\/","name":"TechProComp - Managed IT Service Provider","description":"","publisher":{"@id":"https:\/\/www.techprocomp.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.techprocomp.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.techprocomp.com\/#organization","name":"TechProComp - Managed IT Service Provider","url":"https:\/\/www.techprocomp.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/","url":"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg","contentUrl":"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg","width":1,"height":1,"caption":"TechProComp - Managed IT Service Provider"},"image":{"@id":"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/TechProComp\/","https:\/\/twitter.com\/techprocompcorp"]}]}},"_links":{"self":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security\/1944"}],"collection":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security"}],"about":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/types\/cyber-security"}],"replies":[{"embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/comments?post=1944"}],"version-history":[{"count":0,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security\/1944\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/media\/2129"}],"wp:attachment":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/media?parent=1944"}],"wp:term":[{"taxonomy":"cyber-security_category","embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security_category?post=1944"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}