{"id":2077,"date":"2022-10-21T19:19:23","date_gmt":"2022-10-21T19:19:23","guid":{"rendered":"https:\/\/www.techprocomp.com\/?post_type=cyber-security&#038;p=2077"},"modified":"2023-04-10T15:40:04","modified_gmt":"2023-04-10T15:40:04","slug":"siem-vs-soc","status":"publish","type":"cyber-security","link":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/","title":{"rendered":"SIEM vs. SOC"},"content":{"rendered":"\r\n<!-- Service Content Block -->\r\n<div id=\"particles-js\" class=\"block service-content-block  py-5\">\r\n\r\n    <section class=\"\">\r\n        <!--  Particle effect -->\r\n        <div id=\"\">\r\n            <div class=\"container\">\r\n                <div class=\"row\">\r\n                    <!-- Title -->\r\n                                            <div class=\"col-md-12 text-center mb-5\">\r\n                            <h2 class=\"service-content-block-title-black title-black\">SIEM vs.                                                                 <span class=\"service-content-block-title-blue title-blue\">SOC<\/span>\r\n                            <\/h2>\r\n                            <div class=\"divider mx-auto my-4\"><\/div>                                                    <\/div>\r\n                                        <!-- Left Content -->\r\n                    <div class=\"col-md-4 col-12 service-content-block-left\">\r\n                        <p class=\"service-content-block-left-description\"><strong>Analyze the gathered data and help your team take appropriate measures by following the simple rules previously put in place!<\/strong><\/p>                    <\/div>\r\n                    <!-- Right content -->\r\n                    <div class=\"col-md-8 col-12 service-content-block-right z-index-1\">\r\n                        <div class=\"service-content-block-right-description\" style=\"font-size:px; font-weight:\"><p>Security Incident Event Management (SIEM) is a type of system that gathers and analyzes log data. Security Operations Center (SOC) consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.<\/p>\n<p>These sets of technology help one another with the analyzing log to look for events that require the immediate reaction of the SOC team. Analysts need to look at all alerts they get from the SIEM system and decide whether they need further attention. Alerts could be false positives, meaning the alert isn&#8217;t as dangerous as presented previously and was incorrectly reported by the system.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-3494 size-full\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-2.jpg\" alt=\"\" width=\"750\" height=\"422\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-2.jpg 750w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-2-300x169.jpg 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<\/div>\r\n                        <!-- Read more section -->\r\n                                                    <span id=\"read-more\" class=\"d-block cursor-pointer read-more-style mb-4 text-white\">Read more&#8230;<\/span>\r\n                            <div id=\"read-more-content\" class=\"service-content-block-right-description\"><h3>SIEM Solution<\/h3>\n<p>This solution is made of numerous parts involved in SEM (Security Event Management) and SIM (Security Information Management), including:<\/p>\n<ul>\n<li>Threat Intelligence<\/li>\n<li>Data Aggregation<\/li>\n<li>Advanced Analytics<\/li>\n<li>Security Event Correlation<\/li>\n<li>SOC Automation<\/li>\n<li>Threat Hunting<\/li>\n<li>Dashboards<\/li>\n<li>Forensics<\/li>\n<\/ul>\n<h3>Threat Intelligence<\/h3>\n<p>It&#8217;s well-known that SIEM technology has advanced a lot because cyberspace threats have also advanced.<\/p>\n<p>Threat intelligence involves gathering information about future, current, and past threats regarding cyber security and then analyzing it to see if it is relevant and what kind of effect it would have on the organization. All this gathered information is considered just threat data, but it has no purpose without understanding the importance of this information. However, once the information gets analyzed, it will become useful.<\/p>\n<p>The part that includes analyzing and determining the importance of these cyber threats is the intelligent part of threat intelligence. If it weren&#8217;t for this part, this data could just be analyzed but couldn&#8217;t be used to do further work.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-3495 size-full\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-3.jpg\" alt=\"\" width=\"750\" height=\"422\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-3.jpg 750w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-3-300x169.jpg 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p>Threat intelligence could be looked at as a list that gets updated frequently and contains threats that other organizations, including security companies, share. SIEM systems can scan for patterns thanks to threat intelligence to determine whether the organization is compromised.<\/p>\n<p>These cyber-attacks happen every day, and they can be different daily. That&#8217;s why it is crucial to analyze all the previous attacks and have enough knowledge to prevent future cyber attacks. It wouldn&#8217;t be effective if the security team learned about a new type of attack after it already took place.<\/p>\n<p>Complex Analysis methods that are combined with AI machine learning were developed by SIEM systems to analyze data and decide which part of the data is questionable and which part is intelligent.<\/p>\n<h3><strong>Data Aggregation<\/strong><\/h3>\n<p>SIEM solutions require data from several sources as a part of the data aggregation. The system either collects the data directly or gets the data from other systems. The logs are a series of recorded events that provide previous activity.<\/p>\n<p>SIEM system analyzes events in the logs and categorizes them once it gets the records. SIEM systems are equipped with special software that can analyze events thanks to historical analysis and threat intelligence. The point of this process is to understand which events require attention and which can be left alone at the moment.<\/p>\n<h3><strong>SIEM Forwarders<\/strong><\/h3>\n<p>They send data to the SIEM solution because they include an installation of software that is also known as an agent that can send events to the SIEM solution.<\/p>\n<h3><strong>SIEM Collectors<\/strong><\/h3>\n<p>SIEM collectors can connect to the system and can obtain log data from the system.<\/p>\n<h3><strong>Advanced Analytics<\/strong><\/h3>\n<p>This type of analytics analyzes the gathered data by the SIEM solution to check if the standard behavior has been changed. For example, it&#8217;s expected for employees to log into their accounts during work hours, but if they change that behavior and log in during the night, it can be a reason for further investigation. This could be a false alert, but it will still be marked for analysis.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-3497 size-full\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-4.jpg\" alt=\"\" width=\"750\" height=\"422\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-4.jpg 750w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-4-300x169.jpg 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Security Event Correlation<\/strong><\/h3>\n<p>It involves finding specific patterns in the data gathered by the systems in order to see if any indicators could harm security. If suspicious patterns are located, they will be flagged, and the security team will investigate further to see if the alert requires immediate action or not.<\/p>\n<h3><strong>SOC Automation<\/strong><\/h3>\n<p>It has the same capabilities as a SOC analyst, meaning the systems can act independently in case of a security event. Look at it like this, a particular event will be analyzed, and appropriate measures will be applied afterward.<\/p>\n<h3><strong>Threat Hunting<\/strong><\/h3>\n<p>New threats constantly appear, and threat hunting plays an essential role because organizations should be able to analyze the gathered data by the SIEM solution and take appropriate action afterward. SIEM provides analysis tools that will help the security team determine the impact the threat had on the system.<\/p>\n<h3><strong>Dashboards and Reporting<\/strong><\/h3>\n<p>All SIEM solutions are equipped with dashboards that make looking at threats easy to see what&#8217;s going on across the system. Organizations will also be able to see the number of reports some threats have, meaning they could determine the importance of the threat.<\/p>\n<h3><strong>Forensics<\/strong><\/h3>\n<p>Breached organizations need to determine when did the breach happen, what was affected by the breach, and whether intruders have left the system or not. All this needs to be done fast in order the minimize further exposure.<\/p>\n<p>Data collected over time can be analyzed thanks to forensics, and several events leading to the breach can be seen. They can see initial attacks, the first time the system was breached, and everything else intruders managed to do in the meantime. Cyber security must piece everything together and get all the necessary details to resolve the issue and secure the system again.<\/p>\n<h3><strong>The best SIEM tools<\/strong><\/h3>\n<p>There are numerous SIEM tools that have proven very effective up until today, and some of them are Splunk, Exabeam, and Rapid7.<\/p>\n<h3><strong>Splunk<\/strong><\/h3>\n<p>Splunk is a popular choice amongst many organizations because it provides enterprise-level SIEM functionality.<\/p>\n<h3><strong>Exabeam<\/strong><\/h3>\n<p>Exabeam embraced AI&#8217;s machine learning to scan and try to prevent cyber threats.<\/p>\n<h3><strong>Rapid7<\/strong><\/h3>\n<p>This is one of the newer breeds entering the market to take on the SIEM system providers.<\/p>\n<h3><strong>What is a SOC (Security Operations Center)?<\/strong><\/h3>\n<p>Security Operations Centers offer both incident management and monitoring services. These services are essential to how SOCs work in their everyday activities.<\/p>\n<p>SOC consists of qualified staff actively detecting, monitoring, and improving the organization&#8217;s security. They can respond to security threats using tested processes through their detection, prevention, and analysis work.<\/p>\n<p>SOC Manager is responsible for overseeing the security operations and managing the staff, including engineers, analysts, and security specialists.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone wp-image-3498 size-full\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-1.jpg\" alt=\"\" width=\"750\" height=\"422\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-1.jpg 750w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/siem-vs-soc-content-1-300x169.jpg 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Monitoring<\/strong><\/h3>\n<p>This involves scanning systems for threats regarding security and using specialized tools to get information on suspicious patterns or behaviors. Security tools are connected to systems with dashboards for managing that provide alerts to unusual patterns and activities.<\/p>\n<h3><strong>Incident Management<\/strong><\/h3>\n<p>Incident management is a process of dealing with unusual patterns and activities. This involves trying to determine the threat&#8217;s criticality and then neutralizing the threat by running through various processes. People generally manage the operations, and technology helps by giving more information about the threats.<\/p>\n<h3><strong>SOC Monitoring<\/strong><\/h3>\n<p>Security monitoring involves analyzing and watching an organization&#8217;s environments and systems for security threats. Security monitoring covers an organization&#8217;s network, servers, databases, computers, websites, and more.<\/p>\n<p>In order to protect systems, security tools are used, and one of those tools is breach detection. Some tools provide immediate responses to a breach, like IPS (intrusion prevention systems) and IDS (intrusion detection systems).<\/p>\n<p>Other tools provide delayed responses, such as the SIEM tool. These tools need to collect logs and then analyze them in order to work. It takes time to complete the process, which means these tools cannot work correctly in real time.<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-full wp-image-2166\" src=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/soc-image-4.jpg\" alt=\"\" width=\"750\" height=\"422\" srcset=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/soc-image-4.jpg 750w, https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/soc-image-4-300x169.jpg 300w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Analysis<\/strong><\/h3>\n<p>The SOC&#8217;s main goal is to make sure possible security incidents are recognized correctly and analyzed. Reporting incidents is quite essential, as inaccurate reporting could make a security incident even worse.<\/p>\n<p>The analysis needs to show how the system was breached by finding the point of entry where intruders managed to get in. Once this step is completed, the analysis will look at the size of the breach by checking out whether other systems were compromised and what was potentially stolen and try to develop a detailed map of hacker activities.<\/p>\n<p>SOC analysts have many security tools to aid their analysis work and quickly give them detailed information. Their goal is to analyze incidents and respond to them accordingly.<\/p>\n<p>The analysis will also try to stay ahead of potential threats by establishing rules, analyzing active feeds, identifying exceptions, and improving responses. SOCs are created to improve threat detection by responding faster and more effectively.<\/p>\n<h3><strong>Fixing the issue<\/strong><\/h3>\n<p>After finding a threat, the next step should be containing the threat. The security team needs to find the point of a breach to stop the system&#8217;s further infection. The sooner the point of entry is found, the bigger the chances the security team will have to stop the attack in time. If intruders reach several parts of the systems, appropriate security measures should be put in place to prevent further contamination.<\/p>\n<h3><strong>Why is securing your organization important?<\/strong><\/h3>\n<p>In this day and age, cyber security threats have become so advanced that security teams have to work hard to prevent them all. Doing this without advanced security tools seems almost impossible, which is why TechProComp offers the best cyber security for your organization. Staying ahead of the threats is vital to any security, and you can do that by choosing these services.<\/p>\n<p>If you are thinking about your organization&#8217;s security, you should consider using these services to minimize the risk of getting breached. If you have any further questions about increasing your security, feel free to contact our support team, which will gladly provide all the answers you need to make the right decision.<\/p>\n<\/div>                        \r\n\r\n                        <!-- Schedule button -->\r\n                                                    <a href=\"https:\/\/www.techprocomp.com\/schedule-free-consultation\/\" class=\"hero-block_schedule-btn\">Schedule a free consultation<img decoding=\"async\" src=\"\/wp-content\/uploads\/2023\/10\/arrow-right-tpc-icon.svg\" class=\"img-fluid ms-3 arrow-img\" alt=\"Schedule a free consultation\" width=\"8px\" height=\"8px\" title=\"Schedule a free consultation\" loading=\"lazy\"><\/a>\r\n                                                <!-- Services button -->\r\n                        \r\n                        <!-- Read more section -->\r\n                        \r\n                    <\/div>\r\n                <\/div>\r\n            <\/div>\r\n        <\/div>\r\n    <\/section>\r\n\r\n<\/div><!-- End Service Content Block -->\r\n\r\n<script src=\"https:\/\/cdn.jsdelivr.net\/npm\/particles.js@2.0.0\/particles.min.js\"><\/script>\r\n<script>\r\n    \/* ---- particles.js config ---- *\/\r\n    width = jQuery(document).width();\r\n    if (width > 768) {\r\n        particlesJS(\"particles-js\", {\r\n            \"particles\": {\r\n                \"number\": {\r\n                    \"value\": 40,\r\n                    \"density\": {\r\n                        \"enable\": true,\r\n                        \"value_area\": 600\r\n                    }\r\n                },\r\n                \"color\": {\r\n                    \"value\": \"#0c5adb\"\r\n                },\r\n                \"shape\": {\r\n                    \"type\": \"circle\",\r\n                    \"stroke\": {\r\n                        \"width\": 0,\r\n                        \"color\": \"#ffffff\"\r\n                    },\r\n                    \"polygon\": {\r\n                        \"nb_sides\": 5\r\n                    },\r\n                    \"image\": {\r\n                        \"src\": \"img\/github.svg\",\r\n                        \"width\": 100,\r\n                        \"height\": 100\r\n                    }\r\n                },\r\n                \"opacity\": {\r\n                    \"value\": 0.5,\r\n                    \"random\": false,\r\n                    \"anim\": {\r\n                        \"enable\": false,\r\n                        \"speed\": 0.1,\r\n                        \"opacity_min\": 0.1,\r\n                        \"sync\": false\r\n                    }\r\n                },\r\n                \"size\": {\r\n                    \"value\": 3,\r\n                    \"random\": true,\r\n                    \"anim\": {\r\n                        \"enable\": false,\r\n                        \"speed\": 20,\r\n                        \"size_min\": 0.1,\r\n                        \"sync\": false\r\n                    }\r\n                },\r\n                \"line_linked\": {\r\n                    \"enable\": true,\r\n                    \"distance\": 250,\r\n                    \"color\": \"#ffffff\",\r\n                    \"opacity\": 0.2,\r\n                    \"width\": 1\r\n                },\r\n                \"move\": {\r\n                    \"enable\": true,\r\n                    \"speed\": 2,\r\n                    \"direction\": \"none\",\r\n                    \"random\": true,\r\n                    \"straight\": false,\r\n                    \"out_mode\": \"out\",\r\n                    \"bounce\": false,\r\n                    \"attract\": {\r\n                        \"enable\": false,\r\n                        \"rotateX\": 300,\r\n                        \"rotateY\": 600\r\n                    }\r\n                }\r\n            },\r\n            \"interactivity\": {\r\n                \"detect_on\": \"canvas\",\r\n                \"events\": {\r\n                    \"onhover\": {\r\n                        \"enable\": true,\r\n                        \"mode\": \"repulse\"\r\n                    },\r\n                    \"onclick\": {\r\n                        \"enable\": true,\r\n                        \"mode\": \"push\"\r\n                    },\r\n                    \"resize\": true\r\n                },\r\n                \"modes\": {\r\n                    \"grab\": {\r\n                        \"distance\": 100,\r\n                        \"line_linked\": {\r\n                            \"opacity\": 0.2\r\n                        }\r\n                    },\r\n                    \r\n                    \"repulse\": {\r\n                        \"distance\": 100,\r\n                        \"duration\": 0.4\r\n                    },\r\n                    \"push\": {\r\n                        \"particles_nb\": 4\r\n                    },\r\n                    \"remove\": {\r\n                        \"particles_nb\": 0\r\n                    }\r\n                }\r\n            },\r\n            \"retina_detect\": true,\r\n\r\n        });\r\n    } else {\r\n\r\n    }\r\n<\/script>\r\n","protected":false},"excerpt":{"rendered":"","protected":false},"featured_media":2169,"comment_status":"open","ping_status":"closed","template":"single-cyber-security.php","meta":[],"cyber-security_category":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>SIEM vs. SOC | TechProComp - Managed IT Service Provider<\/title>\n<meta name=\"description\" content=\"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"SIEM vs. SOC | TechProComp - Managed IT Service Provider\" \/>\n<meta property=\"og:description\" content=\"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/\" \/>\n<meta property=\"og:site_name\" content=\"TechProComp - Managed IT Service Provider\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/TechProComp\/\" \/>\n<meta property=\"article:modified_time\" content=\"2023-04-10T15:40:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/soc-image-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"750\" \/>\n\t<meta property=\"og:image:height\" content=\"422\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@techprocompcorp\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/\",\"url\":\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/\",\"name\":\"SIEM vs. SOC | TechProComp - Managed IT Service Provider\",\"isPartOf\":{\"@id\":\"https:\/\/www.techprocomp.com\/#website\"},\"datePublished\":\"2022-10-21T19:19:23+00:00\",\"dateModified\":\"2023-04-10T15:40:04+00:00\",\"description\":\"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.techprocomp.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"SIEM vs. SOC\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.techprocomp.com\/#website\",\"url\":\"https:\/\/www.techprocomp.com\/\",\"name\":\"TechProComp - Managed IT Service Provider\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.techprocomp.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.techprocomp.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.techprocomp.com\/#organization\",\"name\":\"TechProComp - Managed IT Service Provider\",\"url\":\"https:\/\/www.techprocomp.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg\",\"contentUrl\":\"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg\",\"width\":1,\"height\":1,\"caption\":\"TechProComp - Managed IT Service Provider\"},\"image\":{\"@id\":\"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/TechProComp\/\",\"https:\/\/twitter.com\/techprocompcorp\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"SIEM vs. SOC | TechProComp - Managed IT Service Provider","description":"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/","og_locale":"en_US","og_type":"article","og_title":"SIEM vs. SOC | TechProComp - Managed IT Service Provider","og_description":"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.","og_url":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/","og_site_name":"TechProComp - Managed IT Service Provider","article_publisher":"https:\/\/www.facebook.com\/TechProComp\/","article_modified_time":"2023-04-10T15:40:04+00:00","og_image":[{"width":750,"height":422,"url":"https:\/\/www.techprocomp.com\/wp-content\/uploads\/2022\/10\/soc-image-1.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@techprocompcorp","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/","url":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/","name":"SIEM vs. SOC | TechProComp - Managed IT Service Provider","isPartOf":{"@id":"https:\/\/www.techprocomp.com\/#website"},"datePublished":"2022-10-21T19:19:23+00:00","dateModified":"2023-04-10T15:40:04+00:00","description":"SOC consists of processes, people, and technology that act accordingly in the events regarding security that were noticed thanks to the SIEM log analysis.","breadcrumb":{"@id":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.techprocomp.com\/cyber-security\/siem-vs-soc\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.techprocomp.com\/"},{"@type":"ListItem","position":2,"name":"SIEM vs. SOC"}]},{"@type":"WebSite","@id":"https:\/\/www.techprocomp.com\/#website","url":"https:\/\/www.techprocomp.com\/","name":"TechProComp - Managed IT Service Provider","description":"","publisher":{"@id":"https:\/\/www.techprocomp.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.techprocomp.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.techprocomp.com\/#organization","name":"TechProComp - Managed IT Service Provider","url":"https:\/\/www.techprocomp.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/","url":"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg","contentUrl":"https:\/\/techprocomp.rsdevtech.com\/wp-content\/uploads\/2023\/10\/Horizontal-color-1.svg","width":1,"height":1,"caption":"TechProComp - Managed IT Service Provider"},"image":{"@id":"https:\/\/www.techprocomp.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/TechProComp\/","https:\/\/twitter.com\/techprocompcorp"]}]}},"_links":{"self":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security\/2077"}],"collection":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security"}],"about":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/types\/cyber-security"}],"replies":[{"embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/comments?post=2077"}],"version-history":[{"count":0,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security\/2077\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/media\/2169"}],"wp:attachment":[{"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/media?parent=2077"}],"wp:term":[{"taxonomy":"cyber-security_category","embeddable":true,"href":"https:\/\/www.techprocomp.com\/wp-json\/wp\/v2\/cyber-security_category?post=2077"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}